[
  {
    "text": "To handle yourself, use your head; to handle others, use your heart.",
    "author": "Eleanor Roosevelt"
  },
  {
    "text": "My job is not to be easy on people. My job is to make them better.",
    "author": "Steve Jobs"
  },
  {
    "text": "Being responsible sometimes means pissing people off.",
    "author": "Colin Powell"
  },
  {
    "text": "Management is doing things right; leadership is doing the right things.",
    "author": "Peter F. Drucker"
  },
  {
    "text": "Leadership and learning are indispensable to each other.",
    "author": "John F. Kennedy"
  },
  {
    "text": "To do great things is difficult; but to command great things is more difficult.",
    "author": "Friedrich Nietzsche"
  },
  {
    "text": "He who cannot be a good follower cannot be a good leader.",
    "author": "Aristotle"
  },
  {
    "text": "A cowardly leader is the most dangerous of men.",
    "author": "Stephen King"
  },
  {
    "text": "Leadership is unlocking people’s potential to become better.",
    "author": "Bill Bradley"
  },
  {
    "text": "Never give an order that can’t be obeyed.",
    "author": "Douglas MacArthur"
  },
  {
    "text": "He who has great power should use it lightly.",
    "author": "Seneca"
  },
  {
    "text": "When eagles are silent, parrots begin to chatter.",
    "author": "Winston S. Churchill"
  },
  {
    "text": "What you do has far greater impact than what you say.",
    "author": "Stephen Covey"
  },
  {
    "text": "Earn your leadership every day.",
    "author": "Michael Jordan"
  },
  {
    "text": "As we look ahead into the next century, leaders will be those who empower others.",
    "author": "Bill Gates"
  },
  {
    "text": "Do what you feel in your heart to be right — for you’ll be criticized anyway.",
    "author": "Eleanor Roosevelt"
  },
  {
    "text": "A throne is only a bench covered with velvet.",
    "author": "Napoleon Bonaparte"
  },
  {
    "text": "Where there is no vision, there is no hope.",
    "author": "George Washington Carver"
  },
  {
    "text": "Failure is simply the opportunity to begin again, this time more intelligently.",
    "author": "Henry Ford"
  },
  {
    "text": "Whatever you are, be a good one.",
    "author": "Abraham Lincoln"
  }
]