import MainPage from './pages/mainPage';
import Settings from './pages/settings';
import './router';

MainPage.render();
Settings.getLocalStorage();

// eslint-disable-next-line no-console
console.log(`
Выполненные критерии:

✔ Стартовая страница и навигация +20
  - вёрстка, дизайн, UI стартовой страницы приложения. Выполняются требования к вёрстке и оформлению приложения. На стартовой странице есть кнопка, при клике по которой открываются настройки викторины, и две кнопки, при кликах по которым можно выбрать тип вопроса: угадать художника по картине, угадать картину по имени её автора +10
  - реализована навигация по страницам приложения. Со стартовой страницы при клике по кнопке с типом вопроса пользователь попадает на страницу категорий выбранного типа вопросов. Со страницы категорий пользователь может вернуться на стартовую страницу приложения. Со страницы категорий при клике по карточке категории пользователь попадает на страницу с вопросами категории. На карточке сыгранной категории есть кнопка или ссылка, при клике по которой пользователь попадает на страницу с результатами прохождения раунда. Со страницы с вопросами и со страницы с результатами пользователь может вернуться на страницу категорий или на стартовую страницу приложения +10

✔ Настройки +40
  - в настройках есть возможность включать/выключать звук, есть регулятор громкости звука. Если звук включён, есть звуковая индикация разная для правильных и неправильных ответов, звуковое сопровождение окончания раунда +10
  - в настройках есть возможность включать/выключать игру на время. Если выбрана игра на время, на странице с вопросами викторины отображается таймер, отсчитывающий время, которое отведено для ответа на вопрос +10
  - в настройках можно указать время для ответа на вопрос в интервале от 5 до 30 секунд с шагом в 5 секунд. Если время истекает, а ответа нет, это засчитывается как неправильный ответ на вопрос +10
  - при перезагрузке страницы приложения выбранные настройки сохраняются +10

✔ Страница категорий +30
  - вёрстка, дизайн, UI страницы категории. Выполняются требования к вёрстке и оформлению приложения. На странице категорий размещаются карточки категорий. Карточки категорий могут иметь названия, или их можно просто пронумеровать +10
  - карточка сыгранной категории внешне отличается от карточки категории, которая ещё не игралась +10
  - на карточке сыгранной категории отображается результат прохождения раунда - количество вопросов, на которые был дан правильный ответ +10

✔ Страница с вопросами +50
  - вёрстка, дизайн, UI страницы с вопросами. Выполняются требования к вёрстке и оформлению приложения. Вопросы в викторине идут в том порядке, в каком информация про картины и их авторов размещается в коллекции исходных данных +10
  - варианты ответов на вопросы генерируются случайным образом. В вариантах ответов на вопросы викторины должен быть правильный ответ и только один. Правильный ответ в разных вопросах должен находиться на разных местах, а не, например, всегда быть только первым. Варианты ответов должны быть разными. В вариантах ответов не должны повторяться картины одного и того же художника +10
  - правильным и неправильным ответам пользователя соответствуют индикаторы разного цвета +10
  - после того, как ответ выбран, появляется модальное окно с правильным ответом на вопрос и кнопкой "Продолжить". При клике по кнопке "Продолжить" пользователь переходит к следующему вопросу категории +10
  - после окончания раунда выводится уведомление об окончании раунда и его результат - количество вопросов, на которые был дан правильный ответ. Есть кнопка "Продолжить" при клике по которой пользователь перенаправляется на страницу категорий данного типа вопросов +10

✔ Страница с результатами +50
  - вёрстка, дизайн, UI страницы с результатами. Выполняются требования к вёрстке и оформлению приложения +10
  - страница с результатами содержит превью всех картин категории +10
  - картины, на вопросы про которые или про их авторов был дан правильный ответ, цветные; картины, на вопросы про которые или про их авторов был дан неправильный ответ, черно-белые +10
  - при клике по картине выводится информация о ней - название, автор, год создания +10
  - если раунд переигрывался, и результаты изменились, эти изменения отображаются на странице с результатами +10

✔ Плавная смена изображений; картинки сначала загружаются, потом отображаются; нет ситуации, когда пользователь видит частично загрузившиеся изображения. Плавную смену изображений не проверяем: 1) при загрузке и перезагрузке приложения 2) при открытой консоли браузера +10

✔ Реализована анимация отдельных деталей интерфейса, также анимированы переходы и взаимодействия, чтобы работа с приложением шла плавным и непрерывным потоком +20
  - анимация переходов между страницами
  - анимация появления карточек категорий
  - анимация появления всплывающего окна при ответе на вопрос квиза
  - анимация чекбоксов в настройках
  - анимация появления input range в настройках с bounce эффектом
  - анимация иконок в футере при ховере, зацикленная, с паузой при потере ховера
  - анимация появления кнопки score на сыгранной карточке категории
  - анимация появления информации о картине при клике на ней на странице сыгранной категории

✔ Дополнительный функционал на выбор +20
  - возможность открыть приложение во весь экран +2
  - разные уведомления по окончанию раунда в зависимости от результата +2
  - возможность скачать картину на компьютер +5
  - визуальный таймер в виде полосы c плавной анимацией и сменой цвета в зависимости от количества оставшегося времени +3
  - прелоадер при загрузке страницы +3
  - высокое качество оформления приложения, продуманность отдельных деталей интерфейса (различные мелочи начиная от плавной анимации элементов интерфейса и заканчивая отдельными css свойствами для тач устройств, которые не поддерживают ховер, например чтобы был доступ к странице сыгранной категории с телефона) +5


Итого: 240 / 240

Если Вы считаете мою работу достойной находится в списке лучших работ, заполните, пожалуйста, форму - https://forms.gle/C1gXgJv4kGCPiMz9A`);
