[
  {
    "text": "Сложнее всего начать действовать, все остальное зависит только от упорства.",
    "author": "Амелия Эрхарт"
  },
  {
    "text": "Надо любить жизнь больше, чем смысл жизни.",
    "author": "Федор Достоевский"
  },
  {
    "text": "Логика может привести Вас от пункта А к пункту Б, а воображение — куда угодно.",
    "author": "Альберт Эйнштейн"
  },
  {
    "text": "Неосмысленная жизнь не стоит того, чтобы жить.",
    "author": "Сократ"
  },
  {
    "text": "Ваше время ограничено, не тратьте его, живя чужой жизнью.",
    "author": "Стив Джобс"
  },
  {
    "text": "Наука — это организованные знания, мудрость — это организованная жизнь.",
    "author": "Иммануил Кант"
  },
  {
    "text": "В моем словаре нет слова «невозможно».",
    "author": "Наполеон Бонапарт"
  },
  {
    "text": "Свобода ничего не стоит, если она не включает в себя свободу ошибаться.",
    "author": "Махатма Ганди"
  },
  {
    "text": "Лучшая месть – огромный успех.",
    "author": "Фрэнк Синатра"
  },
  {
    "text": "Лучше быть уверенным в хорошем результате, чем надеяться на отличный.",
    "author": "Уоррен Баффет"
  },
  {
    "text": "Стоит только поверить, что вы можете – и вы уже на полпути к цели.",
    "author": "Теодор Рузвельт"
  },
  {
    "text": "У всего есть своя красота, но не каждый может ее увидеть. ",
    "author": "Конфуций"
  },
  {
    "text": "Когда я освобождаюсь от того, кто я есть, я становлюсь тем, кем я могу быть.",
    "author": "Лао Цзы"
  },
  {
    "text": "Счастье – это не нечто готовое. Счастье зависит только от ваших действий.",
    "author": "Далай Лама"
  },
  {
    "text": "Успех — это способность идти от поражения к поражению, не теряя оптимизма",
    "author": "Уинстон Черчилль"
  },
  {
    "text": "Каждый хочет изменить человечество, но никто не задумывается о том, как изменить себя.",
    "author": "Лев Толстой"
  },
  {
    "text": "Определенность цели - отправная точка всех достижений.",
    "author": "Уильям Клемент Стоун"
  },
  {
    "text": "Я не жертва обстоятельств, я - результат моих решений.",
    "author": "Стивен Кови"
  },
  {
    "text": "Поражение – не поражение, если только вы не признаете его таковым в своем сознании.",
    "author": "Брюс Ли"
  },
  {
    "text": "Неудача – это просто возможность начать снова, но уже более мудро.",
    "author": "Генри Форд"
  }
]