if (module.hot) {
  module.hot.accept();
}

import './hamburger';
import './progressBar';
import './exploreSlider';
import './gallery';
import './rippleButton';
import './ticketsPopup';
// import './youtube';
import './detect-webp';
import './welcomeSlider';
import './youtubeSlider';
import './youtubeFrames';
import './videoPlayer';
import './animation';
import './map';

// eslint-disable-next-line no-console
// console.log(`
// Выполненные критерии:

// ✔ Вёрстка соответствует макету. Ширина экрана 1024px +40

// ✔ Вёрстка соответствует макету. Ширина экрана 768px +40

// ✔ Вёрстка соответствует макету. Ширина экрана 420px +40

// ✔ Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки +6

// ✔ Совмещается адаптивная и респонсивная (резиновая) вёрстка +14 При изменении ширины экрана плавно изменяются размеры:

//   - слайдера в секции Welcome +2
//   - слайдера сравнения изображений в секции Explore +2
//   - кастомного видеоплеера в секции Video +2
//   - слайдера в секции Video +2
//   - YouTube-видео в плейлисте в секции Video, маленькие видео выровнены по краям большого +2
//   - галереи изображений и изображений в ней +2
//   - карты +2

// ✔ На ширине экрана 1024рх и меньше реализовано адаптивное меню +12
//   - при нажатии на бургер-иконку меню появляется, плавно выдвигаясь слева, бургер-иконка изменяется на крестик. При нажатии на крестик меню исчезает, плавно возвращаясь назад, иконка крестика превращается в бургер-иконку +2
//   - ссылки в меню работают, обеспечивая плавную прокрутку по якорям +2
//   - при клике по ссылке в адаптивном меню, или при клике по любому месту сайта, кроме самого адаптивного меню, меню закрывается +2
//   - вёрстка меню соответствует макету на всех проверяемых разрешениях +6

// ✔ Оптимизация скорости загрузки страницы +8 

// Итого: 150 / 150 (160)`);
